{
  "index": {
    "title": "Fake JSON REST API data distribution",
    "startButton": "Let's jump into",
    "intro": "is free JSON RESP API data distributor for prototyping and testing API with mock data.",
    "linkTo": "All endpoint are available to use under this URL address",
    "endpointsDescription1": "Description of endpoints and quantity of available records under every endpoint will be listed below.",
    "endpointsDescription2": "More about every endpoint and how they related you can find in",
    "availableEndpoints": "There is a table bellow, illustrating available endpoints and quantity of records per endpoint.",
    "relation": "Keep in mind, that endpoints are related between each other and can be used as improvised database with relations.",
    "docs": "documentation",
    "quantity": "Quantity of records",
    "introMenu": {
      "intro": "Introduction",
      "availableEndpoints": "Available endpoints",
      "examples": "Examples"
    },
    "examplesText": "Here is a couple of example on how you can use endpoints in your own API and for what kind of response you can wait.",
    "examples": {
      "allRecords1": "All records for one resource are available under ",
      "allRecords2": " resource route.",
      "specificRecord1": "If you want to get only one specific record, just specify ",
      "specificRecord2": " of the record for resource.",
      "pagination1": "Also, pagination with total quantity (",
      "pagination2": " param - optional) of resource records is available with ",
      "pagination3": "Also, pagination with total quantity ("
    }
  },
  "about": {
    "title": "About project",
    "contact": "Contact me",
    "description": "is absolutely open-source and free project, that had been created as learn project to learn 3 frameworks - React + Next.js and Nest.js and all AWS deployment staff.",
    "more": "More about every part of project - front-end and back-end - you can find on my GitHub pages",
    "contactTitle": "In case of any questions about project(s) (or even just if you want to chat) always feel free to contact me at - "
  }
}
